-- MySQL dump 10.13  Distrib 5.5.44, for debian-linux-gnu (x86_64)
--
-- Host: 0.0.0.0    Database: bgms
-- ------------------------------------------------------
-- Server version	5.5.44-0ubuntu0.14.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `print_log`
--

DROP TABLE IF EXISTS `print_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `print_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增主键',
  `devID` int(11) DEFAULT NULL COMMENT '设备ID',
  `print_time` varchar(64) DEFAULT NULL COMMENT '打印的时间',
  `print_barcode` varchar(24) DEFAULT NULL COMMENT '打印的一维码内容',
  `print_info` varchar(64) DEFAULT NULL COMMENT '打印的信息',
  `print_type` int(1) NOT NULL COMMENT '打印类型',
  `idtype` varchar(8) NOT NULL COMMENT '证件类型',
  `scan_pic` varchar(64) NOT NULL COMMENT '扫描采集图像存放路径',
  `people_num` int(11) NOT NULL COMMENT '人数（团体票、其他票）',
  `sex` varchar(2) NOT NULL COMMENT '性别',
  `id_num` varchar(32) NOT NULL COMMENT '证件号码',
  `name` varchar(12) NOT NULL COMMENT '姓名',
  `hasChild` int(11) NOT NULL COMMENT '是否携带儿童',
  `hasGroup` int(11) NOT NULL COMMENT '是否为团队携带者',
  `stamp_time` datetime NOT NULL COMMENT '时间戳',
  `result` int(11) NOT NULL COMMENT '打印结果',
  `error_msg` varchar(64) NOT NULL COMMENT '错误信息',
  `isdelete` int(1) NOT NULL COMMENT '是否删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `print_log`
--

LOCK TABLES `print_log` WRITE;
/*!40000 ALTER TABLE `print_log` DISABLE KEYS */;
INSERT INTO `print_log` VALUES (4,3,'2016年1月31日 22:17:52','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-30 22:17:56',1,'打印正常',0),(5,3,'2016年1月31日 22:18:13','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:18:17',1,'打印正常',0),(6,3,'2016年1月31日 22:18:40','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:18:44',1,'打印正常',0),(7,3,'2016年1月31日 22:20:11','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:20:15',1,'打印正常',0),(8,3,'2016年1月31日 22:20:27','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:20:30',1,'打印正常',0),(9,3,'2016年1月31日 22:21:10','E16670386','姓名: 吉丽娜 性别:女 (其他)',1,'其他','',1,'女','E16670386','吉丽娜',0,0,'2016-01-31 22:21:14',1,'打印正常',0),(10,3,'2016年1月31日 22:24:51','W65095688','姓名: 李冰 性别:男 (其他)',1,'其他','',1,'男','W65095688','李冰',0,0,'2016-01-31 22:24:55',1,'打印正常',0),(12,3,'2016年1月31日 22:26:37','123123123','姓名:  性别: (身份证)',1,'身份证','',1,'','123123123','',0,0,'2016-01-31 22:26:41',1,'打印正常',0),(13,3,'2016年1月31日 22:27:36','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:27:40',1,'打印正常',0),(14,3,'2016年1月31日 22:27:42','142234198808072810','儿童票 (身份证)',2,'身份证','',1,'男','142234198808072810','李冰',1,0,'2016-01-31 22:27:46',1,'打印正常',0),(15,3,'2016年1月31日 22:27:48','142234198808072810','团体票:213人 (身份证)',3,'身份证','',213,'男','142234198808072810','李冰',0,1,'2016-01-31 22:27:52',1,'打印正常',0),(16,3,'2016年1月31日 22:27:51','123123123','学生票:123人 (学生证)',4,'学生证','',123,'','123123123','',0,0,'2016-01-31 22:27:55',1,'打印正常',0),(17,3,'2016年1月31日 22:27:56','123123123','其它票类:34人 (其他证件)',5,'其他证件','',34,'','123123123','',0,0,'2016-01-31 22:28:00',1,'打印正常',0),(18,3,'2016年1月31日 22:42:19','KA6364499956','学生票:12222人 (学生证)',4,'学生证','',12222,'','KA6364499956','',0,0,'2016-01-31 22:42:23',1,'打印正常',0),(19,3,'2016年1月31日 22:42:30','PW5959215667','其它票类:2222人 (其他证件)',5,'其他证件','',2222,'','PW5959215667','',0,0,'2016-01-31 22:42:34',1,'打印正常',0),(20,11,'2016年2月18日 15:29:31','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:30:56',1,'打印正常',0),(21,11,'2016年2月18日 15:30:08','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:31:22',1,'打印正常',0),(22,11,'2016年2月18日 15:30:16','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:31:30',1,'打印正常',0),(23,11,'2016年2月18日 15:30:18','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:31:43',1,'打印正常',0),(24,11,'2016年2月18日 15:30:31','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:31:56',1,'打印正常',0),(25,11,'2016年2月18日 15:31:06','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:32:31',1,'打印正常',0),(26,11,'2016年2月18日 15:31:33','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:32:58',1,'打印正常',0),(27,11,'2016年2月18日 15:31:46','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:33:10',1,'打印正常',0),(28,11,'2016年2月18日 15:32:07','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:33:31',1,'打印正常',0),(29,11,'2016年2月18日 15:34:44','141122199409160015','儿童票 (身份证)',2,'身份证','',1,'男','141122199409160015','李杰',1,0,'2016-02-18 15:35:59',1,'打印正常',0),(30,11,'2016年2月18日 15:35:19','AD0451217480','其它票类:3人 (其他证件)',5,'其他证件','',3,'','AD0451217480','',0,0,'2016-02-18 15:36:33',1,'打印正常',0),(31,11,'2016年2月18日 15:35:37','141122199409160015','团体票:5人 (身份证)',3,'身份证','',5,'男','141122199409160015','李杰',0,1,'2016-02-18 15:36:51',1,'打印正常',0),(32,11,'2016年2月18日 15:36:06','OP4796685768','学生票:1人 (学生证)',4,'学生证','',1,'','OP4796685768','',0,0,'2016-02-18 15:37:20',1,'打印正常',0),(33,11,'2016年2月18日 15:43:22','141122199409160015','姓名: 李杰 性别:男 (身份证)',1,'身份证','',1,'男','141122199409160015','李杰',0,0,'2016-02-18 15:44:37',1,'打印正常',0),(34,11,'2016年2月18日 15:43:40','141122199409160015','儿童票 (身份证)',2,'身份证','',1,'男','141122199409160015','李杰',1,0,'2016-02-18 15:45:04',1,'打印正常',0),(44,3,'2016年1月31日 22:17:52','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-23 22:17:56',1,'打印正常',0),(45,3,'2016年1月31日 22:18:13','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-25 22:17:56',1,'打印正常',0),(46,3,'2016年1月31日 22:18:40','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:18:44',1,'打印正常',0),(47,3,'2016年1月31日 22:20:11','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:20:15',1,'打印正常',0),(48,3,'2016年1月31日 22:20:27','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:20:30',1,'打印正常',0),(49,3,'2016年1月31日 22:21:10','E16670386','姓名: 吉丽娜 性别:女 (其他)',1,'其他','',1,'女','E16670386','吉丽娜',0,0,'2016-01-31 22:21:14',1,'打印正常',0),(50,3,'2016年1月31日 22:24:51','W65095688','姓名: 李冰 性别:男 (其他)',1,'其他','',1,'男','W65095688','李冰',0,0,'2016-01-31 22:24:55',1,'打印正常',0),(52,3,'2016年1月31日 22:26:37','123123123','姓名:  性别: (身份证)',1,'身份证','',1,'','123123123','',0,0,'2016-01-31 22:26:41',1,'打印正常',0),(53,3,'2016年1月31日 22:27:36','142234198808072810','姓名: 李冰 性别:男 (身份证)',1,'身份证','',1,'男','142234198808072810','李冰',0,0,'2016-01-31 22:27:40',1,'打印正常',0),(54,3,'2016年1月31日 22:27:42','142234198808072810','儿童票 (身份证)',2,'身份证','',1,'男','142234198808072810','李冰',1,0,'2016-01-31 22:27:46',1,'打印正常',0),(55,3,'2016年1月31日 22:27:48','142234198808072810','团体票:213人 (身份证)',3,'身份证','',213,'男','142234198808072810','李冰',0,1,'2016-01-31 22:27:52',1,'打印正常',0),(56,3,'2016年1月31日 22:27:51','123123123','学生票:123人 (学生证)',4,'学生证','',123,'','123123123','',0,0,'2016-01-31 22:27:55',1,'打印正常',0),(57,3,'2016年1月31日 22:27:56','123123123','其它票类:34人 (其他证件)',5,'其他证件','',34,'','123123123','',0,0,'2016-01-31 22:28:00',1,'打印正常',0),(58,3,'2016年1月31日 22:42:19','KA6364499956','学生票:12222人 (学生证)',4,'学生证','',12222,'','KA6364499956','',0,0,'2016-01-31 22:42:23',1,'打印正常',0),(59,3,'2016年1月31日 22:42:30','PW5959215667','其它票类:2222人 (其他证件)',5,'其他证件','',2222,'','PW5959215667','',0,0,'2016-01-31 22:42:34',1,'打印正常',0);
/*!40000 ALTER TABLE `print_log` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-03-02 14:19:29
